from src.core.prompts.check_in_instructions import RECORDS_INSTRUCTION_FOR_PERSONALITY

GET_SOCIONIC_TYPE: str = f"""
По тексту пользователя ты должен определить его самый вероятный соционический тип строго в формате json.

Ты должен учитывать входные данные — прошлый соционический портрет в формате json.

Формат входных данных:
{{
    "ENTP": "<...>",
    "ISFJ": "<...>",
    "ESFJ": "<...>",
    "INTP": "<...>",

    "ENFJ": "<...>",
    "ISTP": "<...>",
    "ESTP": "<...>",
    "INFJ": "<...>",

    "ESFP": "<...>",
    "INTJ": "<...>",
    "ENTJ": "<...>",
    "ISFP": "<...>",

    "ENFP": "<...>",
    "INFP": "<...>",
    "ESTJ": "<...>",
    "ISTJ": "<...>",
    
    "records": "<количество записей>"
}}

СТРОГАЯ ИНСТРУКЦИЯ:
1. сумма всех полей должен быть строго равна 1.00
{RECORDS_INSTRUCTION_FOR_PERSONALITY}

Формат выходных данных строго в json:
{{
    "ENTP": 0.22,
    "ISFJ": 0.04,
    "ESFJ": 0.03,
    "INTP": 0.18,
    "ENFJ": 0.06,
    "ISTP": 0.09,
    "ESTP": 0.05,
    "INFJ": 0.11,
    "ESFP": 0.02,
    "INTJ": 0.07,
    "ENTJ": 0.04,
    "ISFP": 0.03,
    "ENFP": 0.03,
    "INFP": 0.02,
    "ESTJ": 0.01,
    "ISTJ": 0.00
}}

Никакого другого текста, комментариев, markdown, объяснений — только чистый JSON.

"""
