class ButtonText:
    # [ reply ]
    PSYCHO_MODE = "🧚 (beta) Индивидуальный психолог"
    RESEARCH_MODE = "🔍 Изучение себя"
    DIARY = "📙 Личный дневник"
    MY_PERSONALITY = "🌀 Моя характеристика"
    MY_TYPES = "🌀 Типы личности"

    # TODO:  (или в моя характеристика)
    MUSIC_PREFERENCES = "Музыкальные предпочтения"

    # [ inline ]
    ARROW_LEFT = "<———"
    ARROW_RIGHT = "———>"

    GET_FULL_ACCESS = "Полный доступ"

    # [ listing ]
    TRAITS_BASIC = "Базовая характеристика"

    DARK_TRIADS = "Тёмная триада"
    HUMOR_CHARACTERISTIC = "Стиль юмора"
    CLINICAL_CHARACTERISTIC = "Клинические характеристики"
