class ButtonText:
    # [ reply ]
    PSYCHOLOGIST_BUTTON = "🧚 (beta) Индивидуальный психолог"
    MY_PERSONALITY_TYPES = "🌀 Типы личности"
    CHARACTETISTIC_LISTING = "🌀 Моя характеристика"
    EVERYDAY_QUIZZ = "🎯 Ежедневные квесты"
    # TODO:
    #   - откроется большое сообщение с inline (которые будут генерироваться каждый день (для всех юзеров одинаково, в режиме реального времени))
    #   - генерирует квесты — паки с вопросами, на которые отвечать нужно в виде тестов с клавиатурой (дает баффы к рандомным схемам, которые тоже выбираются ИИ)
    # assistant: {
    #   "questions_pack": {
    #      "questions": "[<вопрос1>, <вопрос2>]",
    #      "answers": "[<ответ на вопрос1>, <...>]"
    #   }
    #   "characteristic": <тип характеристики, который будет улучшаться>,
    # }
    # TODO:  (или в моя характеристика)
    MUSIC_PREFERENCES = "Музыкальные предпочтения"

    # [ inline ]
    ARROW_LEFT = "<———"
    ARROW_RIGHT = "———>"

    GET_FULL_ACCESS = "Полный доступ"

    # [ listing ]
    TRAITS_CORE = "Базовая характеристика"

    DARK_TRIADS = "Тёмная триада"
    HUMOR_CHARACTERISTIC = "Стиль юмора"
    CLINICAL_CHARACTERISTIC = "Клинические характеристики"
