class ButtonText:
    # [ reply ]
    CHARACTETISTIC_LISTING = "🌀 Моя характеристика"
    MY_PERSONALITY_TYPES = "🌀 Типы личности"
    # TODO:
    MUSIC_PREFERENCES = "Музыкальные предпочтения"
    EVERYDAY_QUIZZ = "КВЕСТЫ"   # /ТЕСТЫ
    # TODO:
    #   - откроется большое сообщение с inline (которые будут генерироваться каждый день (для всех юзеров одинаково, в режиме реального времени))
    #   - генерирует квесты — паки с вопросами, на которые отвечать нужно в виде тестов с клавиатурой (дает баффы к рандомным схемам, которые тоже выбираются ИИ)
    # assistant: {
    #   "questions_pack": {
    #      "questions": "[<вопрос1>, <вопрос2>]",
    #      "answers": "[<ответ на вопрос1>, <...>]"
    #   }
    #   "characteristic": <тип характеристики, который будет улучшаться>,
    # }

    # [ inline ]
    # [ listing ]
    BEHAVIORAL_CHARACTERISTIC = "Твоё поведение"
    COGNITIVE_CHARACTERISTIC = "Стиль мышления"
    SOCIAL_CHARACTERISTIC = "Твоя социальность"
    EMOTIONAL_CHARACTERISTIC = "Твоя эмоциональность"

    DARK_TRIADS = "Тёмная триада"
    HUMOR_CHARACTERISTIC = "Стиль юмора"
    CLINICAL_CHARACTERISTIC = "Клинические характеристики"
