class MessageText:
    # [ START ]
    # TODO больше текста и форматирования
    HELLO = (
             "🌀 Привет! Я буду тебя слушать и составлять полный разбор твоей личности. "
             "После этого ты сможешь найти себе идеальную по совместимости пару!\n\n"
             "Начни общаться со мной или расскажи о себе в голосовом или текстовом сообщении."
    )

    # [ MODE ]
    CHOOSE_MODE_TEXT = (
        "Выбери режим использования бота!\n\n"
        f"1. <u>Изучение себя</u>: бот будет задавать вопросы для добавления новых характеристик\n"
        f"1. <u>Общение</u>: бот будет вашим близким другом, который учитывает <b>вашу личность</b>"
    )

    # [ query messages ]
    VOICE_PROCESS = "Обработка голосового сообщения.."
    VOICE_LIMIT = "У тебя закончились голосовые сообщения!"

    # [ MESSAGES ABOVE KEYBOARD ]
    CHARACTERISTIC_LISTING_MESSAGE = "🌀 Выбери доступную для тебя характеристику!"
    CHARACTERISTIC_LISTING_MESSAGE_EMPTY = "На данный момент у вас нет характеристик! Продолжи заполнять свой дневник!"

    # [ LISTING FORMATTER ]
    CHARACTERISTIC_LISTING = (
        "🌀 <b>{characteristic_name}</b>\n\n"
        "{characteristic}"
        "<b>Точность оценки:</b> {accuracy_percent}%\n"
        "<b>Последнее обновление:</b> {last_update}"
    )
    CHARACTERISTIC_LISTING_GROUP = (
        "🌀 <b>{group_name}</b>\n\n"
        "{all_text}"
        "<b>Точность оценки:</b> {accuracy_percent}%\n"
        "<b>Последнее обновление:</b> {last_update}"
    )
