from src.core.enums.user import TALKING_MODES


class MessageText:
    # [ START ]
    # TODO больше текста и форматирования
    HELLO = (
             "🌀 Привет! Я буду тебя слушать и составлять полный разбор твоей личности. "
             "После этого ты сможешь найти себе идеальную по совместимости пару!\n\n"
             "Начни общаться со мной или расскажи о себе в голосовом или текстовом сообщении."
    )

    # [ MODE ]
    @staticmethod
    def choose_talking_mode(mode: TALKING_MODES) -> str:
        if mode == TALKING_MODES.RESEARCH:
            return (
                "<b>режим:</b>\n\n"
                "🔍 Изучение себя:\n"
                "<blockquote>"
                "Я буду задавать вопросы для <b>изучения</b> вашей личности"
                "</blockquote>\n\n"
            )
        elif mode == TALKING_MODES.INDIVIDUAL_PSYCHO:
            return (
                "<b>режим:</b>\n\n"
                "🧚 Индивидуальный психолог:\n"
                "<blockquote> "
                "Я буду учитывать твои <b>типы личности</b> и <b>характеристику</b> во время нашей тёплой беседы."
                "</blockquote>\n\n"
            )
        return ""

    # [ query messages ]
    VOICE_PROCESS = "Обработка голосового сообщения.."
    VOICE_LIMIT = "У тебя закончились голосовые сообщения!"

    # [ MESSAGES ABOVE KEYBOARD ]
    CHARACTERISTIC_LISTING_MESSAGE = "🌀 Выбери доступную для тебя характеристику!"
    CHARACTERISTIC_LISTING_MESSAGE_EMPTY = "На данный момент у вас нет характеристик! Продолжи заполнять свой дневник!"

    # [ LISTING FORMATTER ]
    CHARACTERISTIC_LISTING = (
        "🌀 <b>{characteristic_name}</b>\n\n"
        "{characteristic}"
        "<b>Точность оценки:</b> {accuracy_percent}%\n"
        "<b>Последнее обновление:</b> {last_update}"
    )
    CHARACTERISTIC_LISTING_GROUP = (
        "🌀 <b>{group_name}</b>\n\n"
        "{all_text}"
        "<b>Точность оценки:</b> {accuracy_percent}%\n"
        "<b>Последнее обновление:</b> {last_update}"
    )

    # [ Diary ]
    DIARY_LISTING = (
        "📙 Выбери запись в дневнике за любой день!"
    )

    DIARY_RECORD = (
        "<b>Запись:</b>\n\n"
        "— <u>{diary_context}</u>\n\n"
        "<blockquote>{text}</blockquote>\n\n"
        "<i>{date_str}</i>\n"
    )
